# Урок 2. Циклы (for, while)
# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.
# 5 -> 1 0 1 1 0
# 2

heads = tails = 0
coins = [1, 0, 1, 1, 0]
for i in coins:
    if i:
        heads += 1
    else:
        tails += 1
print(min(heads, tails))
